package hw3;

import java.util.Scanner;

public class Task5 {
    /*    Написать программу, используя тернарный оператор, где пользователь вводит с клавиатуры два числа и
    символ - или + или % или / или *. На экран выводится результат действия над двумя введенными числами.
    Если пользователь ввел что-то кроме данных символов, то необходимо вывести 0.*/
    public static void main(String[] args) {

            Scanner scanner = new Scanner(System.in);
            System.out.println("Insert first number");
            int firstNumber = scanner.nextInt();
            System.out.println("Insert symbol");
            String symbol = scanner.nextLine();
            System.out.println("Insert second number");
            int secondNumber = scanner.nextInt();
            int resultOfExpression;
            System.out.println();
            int result;

    }
}
// На этих операторах я сдалась. Я не понимаю что нужно делать